{
  "instructions": {
    "controls": "Используйте стрелки или A/D для движения и Пробел для прыжка.",
    "goal": "Прыгайте на платформы, чтобы узнать больше о моем опыте."
  },
  "sections": {
    "techStack": "Технологический стек",
    "responsibilities": "Обязанности и достижения",
    "additional": "Дополнительный опыт"
  },
  "platforms": {
    "toptal": {
      "company": "Toptal",
      "period": "Сентябрь 2019 - Июнь 2020",
      "intro": "Кросс-функциональная команда из 5 человек (2 FE, 2 BE, 1 QA)\nРазработка B2C платформы электронной коммерции с акцентом на аутентификацию и основные пользовательские функции.",
      "techStack": "React, Redux, Node.js, Express, PostgreSQL, MongoDB",
      "achievements": [
        "Спроектировал и реализовал безопасную систему аутентификации: JWT-авторизация, социальные логины, подтверждение email и защита от CSRF/XSS.",
        "Разработал каталог продуктов с расширенной фильтрацией и корзину покупок с использованием Redux для оптимальной производительности.",
        "Создал REST API endpoints для операций с продуктами на Node.js и Express.",
        "Активно участвовал в agile-церемониях: ежедневных стендапах, планировании спринтов и код-ревью."
      ]
    },
    "upwork": {
      "company": "Upwork",
      "period": "Август 2020 - Май 2021",
      "intro": "Кросс-функциональная команда из 4 человек (FE, BE, QA, Дизайнер)\nРазработка многофункциональной платформы для управления задачами с расширенными возможностями совместной работы.",
      "techStack": "React, Context API, TypeScript, React Router, Draft.js, react-beautiful-dnd, Material-UI",
      "achievements": [
        "Создал комплексную систему навигации с React Router, включая вложенную маршрутизацию для проектов и задач.",
        "Разработал продвинутый поиск с дебаунс-интеграцией с backend API.",
        "Реализовал текстовый редактор в стиле Google Docs с использованием Draft.js.",
        "Создал интуитивный drag-and-drop интерфейс для организации задач с помощью react-beautiful-dnd.",
        "Спроектировал масштабируемое управление состоянием с использованием Context API и TypeScript."
      ]
    },
    "workhuman": {
      "company": "WorkHuman",
      "period": "Май 2022 - Май 2023",
      "intro": "Agile команда в среднем из 7 человек (2 FE, 2 BE, 2 QA, Дизайнер)\nРазработка платформы управления наградами сотрудников практически с нуля.",
      "techStack": "React, TypeScript, Context API, React Router, Custom UI library",
      "achievements": [
        "Самостоятельно выполнил полную миграцию кодовой базы с JavaScript на TypeScript за один месяц.",
        "Разработал кастомный компонент таблицы данных с клиентской фильтрацией по нескольким критериям, сортировкой и пагинацией для 1000+ записей.",
        "Создал сложную систему фильтрации с обновлениями в реальном времени с использованием Context API.",
        "Реализовал полный workflow наград с разрешениями на основе ролей и диалогами подтверждения."
      ],
      "additional": [
        "Работал над legacy проектом на JSP (JavaServer Pages), внедряя модификации и поддерживая страницы с серверным рендерингом."
      ]
    },
    "chulakov": {
      "company": "Chulakov Studio",
      "period": "Май 2024 - Настоящее время",
      "intro": "Команда из 6 человек (2 FE, 2 BE, QA, Аналитик)\nРазработка приложения для мониторинга безопасности для крупной финансовой организации.",
      "techStack": "React 18, MobX, TypeScript, Highcharts, React Router, Микрофронтенд архитектура",
      "achievements": [
        "Спроектировал и разработал микрофронтенд модуль на React, MobX и TypeScript для потоков данных в реальном времени.",
        "Создал комплексный набор аналитических дашбордов с использованием Highcharts, создав несколько типов кастомных визуализаций (линейные, столбчатые, круговые диаграммы, тепловые карты).",
        "Разработал высоко кастомизированные интерактивные компоненты графиков с возможностями drill-down и синхронизацией данных между графиками.",
        "Оптимизировал производительность рендеринга для визуализации больших объемов данных, эффективно обрабатывая тысячи точек данных.",
        "Систематически отлаживал и решал критические проблемы в приложении, включая race conditions, ошибки UI логики и утечки памяти."
      ]
    }
  }
}
